app/views/contests/index.html.erb

SELECT "contests".* FROM "contests"
---
  <tr>
    <td><%= contest.firstContestant %></td>