app/controllers/contests_controller.rb

  def index
    @contests = Contest.all
---
SELECT "contests".* FROM "contests"

  def show
    @contest = Contest.find(params[:id])
---
SELECT "contests".* FROM "contests" WHERE "contests"."id" = ? LIMIT 1  [["id", "1"]]